tap "homebrew/services"

# Use Bash
brew "bash"

# Homebrew Python
brew "python"
brew "python@2"

# Homebrew Ruby
brew "ruby"

# GNU File, Shell, and Text utilities
brew "coreutils", args: ["with-gmp"]
brew "findutils" # find, xargs, and locate
brew "gnu-tar"
brew "gnu-sed", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]
brew "gzip"
brew "gettext"

brew "openssl"
brew "make"
brew "tree"
brew "wget", args: ["with-iri"]
brew "curl"
brew "pstree"
brew "unzip"
brew "less"

# Git
brew "git"
brew "git-now"
brew "hub"
brew "tig"
# https://github.com/cli/cli
brew "github/gh/gh"

brew "macvim", args: ["with-lua", "with-override-system-vim"]
brew "tmux"
brew "reattach-to-user-namespace"

# Useful tools
brew "the_silver_searcher"
brew "jq"
brew "nkf"
brew "shellcheck"
brew "gibo"
brew "starship"

# CLI
brew "node"
brew "yarn"

# version managements
brew "pyenv"
brew "ruby-build"   #depends on rbenv
brew "rbenv"
brew "jenv"
brew "plenv"
brew "node-build"   #depends on nodenv
brew "nodenv"
brew "direnv"

# Go
brew "go"
brew "ghq"
brew "glide"
brew "peco"

# Module by Homebrew-python
brew "pipenv"
brew "awscli"
brew "ansible"

# Ricty - https://github.com/sanemat/homebrew-font
tap "sanemat/font"
brew "fontforge"
brew "ricty", args: ["with-powerline"]

# completion
brew "bash-completion@2" #for Bash 4.1+
brew "pip-completion"
brew "docker-completion"
brew "docker-machine-completion"
brew "docker-compose-completion"
brew "vagrant-completion"
brew "django-completion"
brew "yarn-completion"
