# Use Bash
brew "bash"

# Homebrew Python
brew "python@3.10"
brew "python@3.9"
brew "python@3.8"

# Homebrew Ruby
brew "ruby"

# Homebrew PHP
brew "php"
brew "php@7.4"

# GNU File, Shell, and Text utilities
brew "coreutils"
brew "findutils" # find, xargs, and locate
brew "gnu-tar"
brew "gnu-sed"
brew "grep"
brew "gzip"
brew "gettext"

brew "openssl"
brew "make"
brew "tree"
brew "wget"
brew "curl"
brew "pstree"
brew "unzip"
brew "less"

# Git
brew "git"
brew "tig"
brew "gh"

brew "macvim"
brew "tmux"
brew "reattach-to-user-namespace"

# Useful tools
brew "the_silver_searcher"
brew "jq"
brew "nkf"
brew "shellcheck"
brew "gibo"
brew "starship"
brew "asciinema"

# Dev tools
brew "node"
brew "yarn"
brew "pipenv"

# version management
brew "pyenv"
# brew "ruby-build"   #depends on rbenv
# brew "rbenv"
brew "jenv"
#brew "plenv"
# brew "node-build"   #depends on nodenv
brew "nodenv"
brew "tfenv"
brew "direnv"

# Go
brew "go"
brew "ghq"
#brew "glide"
brew "peco"

# AWS
brew "awscli"
brew "aws-cdk"
# AWS assume role - https://github.com/remind101/assume-role
tap "remind101/formulae"
brew "remind101/formulae/assume-role"

## Ricty - https://github.com/sanemat/homebrew-font
#tap "sanemat/font"
#brew "fontforge"
#brew "ricty", args: ["with-powerline"]

# completion
brew "bash-completion@2" #for Bash 4.1+
brew "pip-completion"
brew "docker-completion"
brew "vagrant-completion"
brew "django-completion"
brew "yarn-completion"

#======================================
# cask
#======================================
cask "docker"
cask "discord"
cask "paw"
cask "inkdrop"
cask "drawio"
cask "aws-vault"
